export class Point {
    _x: number;
    _y:number;

    // new Point(1,2) כאשר אנו מכניסים פרמטרים לתוך הקונסטרקטור שלנו אנו בעצם קובעים שכל משתנה שיהיה מופע של הקלאס שלנו הצטרך להכניס פרמטרים לקלאס לדוג'
    //(הכוונה למשתנה של הקלאס שאנו בתוכו this) ובתוך הסקופ של הקונסטרקטור אנו אומרים שהערכים שיוכנסו יהיו שווים למשתנים של הקלאס שלנו
    // אך במידה ואנו מוסיפים כמו פה את הסימן שאלה אנו לא מחייבים את היוזר להכניס פרמטרים
    constructor(_x?:number, _y?:number)
    {
        this._x=_y;
        this._y=_y;
    }
    draw(){
        console.log("x: " + this._x + " y:" + this._y);   
    }

    //כאן אנו יוצרים גטאר וסאטר ע''י יצור של פונקציות ויש לשים לך ששמנו פה איקס גדול כי אחרת המנוע יחשוב שזה האיקס של המשתנה  
    get X(){
        return this._x
    }
    set X(value){
        this._x = value
    }
}

let point: Point = new Point(3,3)
point._x=1;
point._y=2;
point.draw()